[Timeout] BlockStatement
src/Roller.ts:10:32
     // specifies the number of faces the die has. It must have at least 2 faces
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
-    constructor(faces: number) {
-        if(faces>=2)
-            this._faces=faces;
-        else 
-            this._faces=6;
-    }
+    constructor(faces: number) {}
 
     // specifies which number should be rolled and returns the recorded roll. 

[Timeout] ConditionalExpression
src/Roller.ts:11:12
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
     constructor(faces: number) {
-        if(faces>=2)
+        if(true)
             this._faces=faces;
         else 

[Timeout] EqualityOperator
src/Roller.ts:11:12
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
     constructor(faces: number) {
-        if(faces>=2)
+        if(faces > 2)
             this._faces=faces;
         else 

[Survived] BooleanLiteral
src/Roller.ts:28:18
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
     roll(value: number): number{
-        let flag=false;
+        let flag=true;
         if(value>=1 && value<=this._faces){
             this._last=value;

[Killed] EqualityOperator
src/Roller.ts:29:12
     //      of rolls for that face by 1
     roll(value: number): number{
         let flag=false;
-        if(value>=1 && value<=this._faces){
+        if(value < 1 && value<=this._faces){
             this._last=value;
             // for (let i=0;i<this._distribution.size;i++){
killedBy: Roll die
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] ConditionalExpression
src/Roller.ts:29:12
     //      of rolls for that face by 1
     roll(value: number): number{
         let flag=false;
-        if(value>=1 && value<=this._faces){
+        if(false){
             this._last=value;
             // for (let i=0;i<this._distribution.size;i++){
killedBy: Roll die
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Timeout] ConditionalExpression
src/Roller.ts:37:16
             //     else
             //         this._distribution.set(value,1);
             // }
-            if(this._distribution){
+            if(true){
                 this._distribution.forEach((val: number, key: number) => {
                     //console.log(key, value);

[NoCoverage] BlockStatement
src/Roller.ts:37:35
             //     else
             //         this._distribution.set(value,1);
             // }
-            if(this._distribution){
-                this._distribution.forEach((val: number, key: number) => {
-                    //console.log(key, value);
-                    if(key==value){
-                        this._distribution.set(key,val+1);
-                        flag=true;
-                    }
-                        
-                        //val+=1;
-                    // else
-                    //     this._distribution.set(value,1);
-
-                });
-                if(flag==false)
-                    this._distribution.set(value,1);
-            }
+            if(this._distribution){}
             // else
             //     this._distribution.set(value,1);

[NoCoverage] BlockStatement
src/Roller.ts:38:74
             //         this._distribution.set(value,1);
             // }
             if(this._distribution){
-                this._distribution.forEach((val: number, key: number) => {
-                    //console.log(key, value);
-                    if(key==value){
-                        this._distribution.set(key,val+1);
-                        flag=true;
-                    }
-                        
-                        //val+=1;
-                    // else
-                    //     this._distribution.set(value,1);
-
-                });
+                this._distribution.forEach((val: number, key: number) => {});
                 if(flag==false)
                     this._distribution.set(value,1);

[NoCoverage] ConditionalExpression
src/Roller.ts:40:24
             if(this._distribution){
                 this._distribution.forEach((val: number, key: number) => {
                     //console.log(key, value);
-                    if(key==value){
+                    if(false){
                         this._distribution.set(key,val+1);
                         flag=true;

[NoCoverage] ConditionalExpression
src/Roller.ts:40:24
             if(this._distribution){
                 this._distribution.forEach((val: number, key: number) => {
                     //console.log(key, value);
-                    if(key==value){
+                    if(true){
                         this._distribution.set(key,val+1);
                         flag=true;

[NoCoverage] ArithmeticOperator
src/Roller.ts:41:52
                 this._distribution.forEach((val: number, key: number) => {
                     //console.log(key, value);
                     if(key==value){
-                        this._distribution.set(key,val+1);
+                        this._distribution.set(key,val - 1);
                         flag=true;
                     }

[NoCoverage] BooleanLiteral
src/Roller.ts:42:30
                     //console.log(key, value);
                     if(key==value){
                         this._distribution.set(key,val+1);
-                        flag=true;
+                        flag=false;
                     }
                         

[NoCoverage] BooleanLiteral
src/Roller.ts:50:26
                     //     this._distribution.set(value,1);
 
                 });
-                if(flag==false)
+                if(flag==true)
                     this._distribution.set(value,1);
             }

[NoCoverage] ConditionalExpression
src/Roller.ts:50:20
                     //     this._distribution.set(value,1);
 
                 });
-                if(flag==false)
+                if(false)
                     this._distribution.set(value,1);
             }

[Timeout] BlockStatement
src/Roller.ts:65:20
 
     // returns the value of the latest die roll. If no rolls have been made
     // yet, then it should return 0.
-    last(): number {
-        if(this._last>0)
-            return this._last;
-        else
-            return 0;
-    }
+    last(): number {}
 
     // returns a Map that represents the current distribution of rolls for each

[Survived] ConditionalExpression
src/Roller.ts:66:12
     // returns the value of the latest die roll. If no rolls have been made
     // yet, then it should return 0.
     last(): number {
-        if(this._last>0)
+        if(false)
             return this._last;
         else

[Timeout] ConditionalExpression
src/Roller.ts:66:12
     // returns the value of the latest die roll. If no rolls have been made
     // yet, then it should return 0.
     last(): number {
-        if(this._last>0)
+        if(true)
             return this._last;
         else

[NoCoverage] BlockStatement
src/Roller.ts:77:40
     // value and its value should be the number of times that face has been
     // rolled. Even if a face has not yet been rolled, its key should have a
     // value of 0.
-    distribution(): Map<number, number>{
-        return new Map<number, number>();
-    }
+    distribution(): Map<number, number>{}
 } // end of Roller class
