[Killed] ConditionalExpression
src/Roller.ts:29:24
     //      of rolls for that face by 1
     roll(value: number): number{
         let flag=false;
-        if(value>=1 && value<=this._faces){
+        if(value>=1 && true){
             this._last=value;
             // for (let i=0;i<this._distribution.size;i++){
killedBy: Return last face of die3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 6

[Killed] BlockStatement
src/Roller.ts:40:35
             if(this._distribution){
                 this._distribution.forEach((val: number, key: number) => {
                     //console.log(key, value);
-                    if(key==value){
-                        this._distribution.set(key,val+1);
-                        flag=true;
-                    }
+                    if(key==value){}
                         
                         //val+=1;
killedBy: Last test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] BlockStatement
src/Roller.ts:53:17
                 if(flag==false)
                     this._distribution.set(value,1);
             }
-            else{
-                this._distribution=new Map();
-                this._distribution.set(value,1);
-
-            }
+            else{}
                 
             return value;
killedBy: Last test
statusReason: TypeError: Cannot read properties of undefined (reading 'get')

[Killed] EqualityOperator
src/Roller.ts:70:12
     // returns the value of the latest die roll. If no rolls have been made
     // yet, then it should return 0.
     last(): number {
-        if(this._last>0)
+        if(this._last <= 0)
             return this._last;
         else
killedBy: Return last face of die1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] BlockStatement
src/Roller.ts:81:40
     // value and its value should be the number of times that face has been
     // rolled. Even if a face has not yet been rolled, its key should have a
     // value of 0.
-    distribution(): Map<number, number>{
-        //return new Map<number, number>();
-        return this._distribution;
-    }
+    distribution(): Map<number, number>{}
 } // end of Roller class
killedBy: Last test
statusReason: TypeError: Cannot read properties of undefined (reading 'get')
